---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..RevisionFailures Members
BuiltInFailures..::..RevisionFailures Class Properties See Also Send Feedback
---

Provides a container of all Revit built-in FailureDefinitionId instances.

The BuiltInFailures..::..RevisionFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | RevisionSettingsDuplicateName | More than one Revisons have the same name %1!s!. |

# See Also

BuiltInFailures..::..RevisionFailures Class

Autodesk.Revit.DB Namespace